In [1]:
import pandas as pd

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
#o método split(), que converte uma string em elementos individualizados.
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [6]:
#selecionar as colunas de df: passaremos o rótulo c1: Será criada uma Series com os valores da primeira coluna :
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [7]:
type(df['c1'])

pandas.core.series.Series

In [8]:
#Podemos selecionar mais de uma coluna de nosso DataFrame
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [9]:
#Quando queremos fazer a seleção de todas as linha do DataFrame
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [11]:
#somente das linhas l2 e l3. A seleção começa inclusivo e termina exclusivo (seleciona do index 1 ao 2)
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [12]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [15]:
#seleções a partir do rótulo das linhas. Retorna uma Series
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [14]:
type(df.loc['l3'])

pandas.core.series.Series

In [16]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [17]:
#uma linha e uma coluna, como uma notação matricial. Retorna necessariamente um único elemento?
df.loc['l1', 'c2']

2

In [19]:
#Retorna um "int", não uma Series
type(df.loc['l1', 'c2'])

numpy.int64

In [21]:
#Outro indexador disponível é o iloc[] , que utiliza os índices numéricos.
#O primeiro é o índice da linha (0) e o segundo da cóluna. Logo, l1,c2
df.iloc[0,1]

2

In [22]:
df.loc[['l3', 'l1'], ['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [23]:
#Mesmo dataframe acima mas com index numérico
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1